blog/drafts/missing_in_ppl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-20 Fri 09:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Missing features in PPLs</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Missing features in PPLs</h1>
<p>
I recently asked an open question on Mastodon:
</p>

<blockquote>
<p>
What do you wish you could do with a PPL that no PPL currently allows you to do?
</p>
</blockquote>

<p>
And I got very interesting answers.
</p>

<div id="outline-container-orgeec94f1" class="outline-2">
<h2 id="orgeec94f1">Nicolas Chopin</h2>
<div class="outline-text-2" id="text-orgeec94f1">
<blockquote>
<p>
To describe algorithms rather than describe models.
</p>

<p>
A Gibbs sampler where for component 3 and 12 you want to change the parametrization, or use a specific Metropolis step. Or one of the nonstandard gradient base samplers found in the paper by Titsias and Ppaspollopoulos, with preconditioners based on your prior. Or SMC samplers, etc.
</p>

<p>
It would be nice to describe any stochastic algorithm you can think of.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgca95b74" class="outline-2">
<h2 id="orgca95b74">Matthew O'Meara</h2>
<div class="outline-text-2" id="text-orgca95b74">
<blockquote>
<p>
Debugging as easy as stepping through the code line by line. Of the ones I've used, in Pyro the tracing makes it hard, in Stan it's impossible.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org8a9abfc" class="outline-2">
<h2 id="org8a9abfc">Virgile Andreani</h2>
<div class="outline-text-2" id="text-org8a9abfc">
<blockquote>
<p>
Infer parameters of stiff ODEs/PDEs without fear that I'm going to sample a parameter set which will break the numerical integration.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgcda121b" class="outline-2">
<h2 id="orgcda121b">Jonathan Harrison</h2>
<div class="outline-text-2" id="text-orgcda121b">
<blockquote>
<p>
Inference with ODEs and PDEs.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgbc4cc36" class="outline-2">
<h2 id="orgbc4cc36">Dae Houlilan</h2>
<div class="outline-text-2" id="text-orgbc4cc36">
<blockquote>
<p>
Focus on model building and spend less time finding reparametrization for difficult posterior geometries.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org2f195b6" class="outline-2">
<h2 id="org2f195b6">Moritz Shauer</h2>
<div class="outline-text-2" id="text-org2f195b6">
<blockquote>
<p>
Get the Markov blanker / conditional independence graph of the probabilistic program.
</p>
</blockquote>

<ul class="org-ul">
<li>Inference compilation</li>
<li>Parallel Gibbs samplers</li>
<li>Gibbs sampler version of the Bouncy Particle Sample: <a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/1510.02451">https://arxiv.org/abs/1510.02451</a></li>
</ul>

<blockquote>
<p>
Work with distributions that are discrete-continous mixtures
</p>
</blockquote>

<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/2103.08478">Sticky PDMP sampler</a></li>
</ul>

<blockquote>
<p>
Run a code-to-code transformation over a probabilistic program.
</p>
</blockquote>

<blockquote>
<p>
Use a reference measure of my choice to express target densities.
</p>
</blockquote>

<ul class="org-ul">
<li>Wiener measure as in <a target='_blank' rel='noopener noreferrer' class='external' href="https://twitter.com/ChadScherrer/status/1509218598337740801">https://twitter.com/ChadScherrer/status/1509218598337740801</a></li>
</ul>

<blockquote>
<p>
Treat inifinte dimensional distributions gracefully.
</p>
</blockquote>

<p>
Larry Shamala as well.
</p>
</div>
</div>
</div>
</body>
</html>